[
  {
    "slug": "on-clear-signals",
    "title": "On Clear Signals",
    "summary": "On the energy cost of ambiguity and how curating an environment of clear, honest signals allows the nervous system to heal and real connection to flourish."
  },
  {
    "slug": "why-i-turned-off-notifications-again",
    "title": "Why I Turned Off Notifications Again",
    "summary": "A morning realization about notifications, doom-scrolling, and choosing presence over feeds. Why the first moments of the day matter."
  },
  {
    "slug": "an-invitation-to-the-end-of-wealth-worship-and-the-beginning-of-a-human-future",
    "title": "An Invitation to the End of Wealth Worship — and the Beginning of a Human Future",
    "summary": "A call to build a society where safety, dignity, and love are non-negotiable for all. Challenging the systems that measure worth by productivity and wealth by virtue."
  },
  {
    "slug": "season-of-becoming",
    "title": "November 6, 2025 — Season of Becoming",
    "summary": "A line in the sand. Moving from performing growth to living it, from articulation to embodiment, from insight to integration."
  },
  {
    "slug": "love-is-the-final-revolution",
    "title": "Love Is the Final Revolution",
    "summary": "After nearly losing myself to global chaos, I found the most radical act isn't outrage — it's love. A reflection on politics, fear, and why building a home rooted in kindness may be the ultimate rebellion."
  },
  {
    "slug": "an-hour-of-hair-brushing-what-my-daughter-taught-me-about-time",
    "title": "An Hour of Hair Brushing: What My Daughter Taught Me About Time",
    "summary": "Sometimes the most radical thing you can do is sit still with your daughter and brush her hair for an hour."
  },
  {
    "slug": "who-really-raised-me",
    "title": "Who, really, raised me?",
    "summary": "A deep dive into the fictional characters that shaped my values, from childhood cartoons to adult anime. Discover how Samurai X, Dragon Ball Z, Berserk, and especially One Punch Man's Saitama became my true mentors, teaching me about discipline, brotherhood, pain as power, and the loneliness of mastery."
  },
  {
    "slug": "the-rhythm-of-grief-summer-days-and-letting-go",
    "title": "The Rhythm of Grief",
    "summary": "On how loss reshapes the inner world—and why grief has its own tempo you can't outthink or outrun."
  },
  {
    "slug": "symbols-of-power",
    "title": "Symbols of Power",
    "summary": "A look at the objects, rituals, and quiet choices that shape personal sovereignty more than motivation ever will."
  }
]